FSI/tutorials/turek-hron-fsi3/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: With OpenFOAM v1806 and OpenFOAM 6, the DyM solvers
// were marked deprecated and merged into their respective standard solvers.
application         pimpleFoam;    // OpenFOAM v1806, OpenFOAM 6, or newer
// application         pimpleDyMFoam; // OpenFOAM v1712, OpenFOAM 5.x, or older

libs ( "libgroovyBC.so" ) ;

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             15;

deltaT              1e-3;

writeControl        adjustableRunTime;

writeInterval       0.1;

purgeWrite          0;

writeFormat         ascii;

writePrecision      10;

writeCompression    off;

timeFormat          general;

timePrecision       8;

functions
{
    forces
    {
        type                forces;
        libs                ( "libforces.so" );
        patches             (cylinder flap);
        rho                 rhoInf;
        log                 true;
        rhoInf              1000;
        CofR                (0 0 0);
    }

    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }
}
