FSI/tutorials/turek-hron-fsi3/fluid-openfoam/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           1e-5;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        tolerance       1e-07;
        relTol          0;
    }

    pcorr
    {
        solver           GAMG;
        tolerance        1e-5;
        relTol           1e-4;
        smoother         GaussSeidel;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    phi
    {
        $p;
    }

    "(U|cellDisplacement)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          1e-6;
    }

    "(U|cellDisplacement)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 50;
    nCorrectors 2;
    nNonOrthogonalCorrectors 1;
    tolerance 1.0e-12;

    correctPhi          yes;
    relTol 1e-4;
    pisoTol 1e-6;
    consistent  true;

    // OpenFOAM (.com), OpenFOAM 5 or older (.org)
    residualControl
    {
	U
	{
		tolerance 1e-5;
		relTol	  0;
	}

	p
	{
		tolerance 1e-5;
		relTol	  0;
	}
    }

    // OpenFOAM 6 (.org) or newer
    /*
    residualControl
    {
        U 1e-5;
        p 1e-5;
    }
    */

}
PISO
{
    nNonOrthogonalCorrectors 1;
}
potentialFlow
{
    nNonOrthogonalCorrectors 1;
}


// ************************************************************************* //
